return {
  titles = {
    "1,TA5: Будущее",
    "2,Источники энергии",
    "3,Термоядерный реактор TA5",
    "4,Магнит термоядерного реактора TA5",
    "4,Насос TA5",
    "4,Теплообменник TA5",
    "4,Контроллер термоядерного реактора TA5",
    "4,Корпус термоядерного реактора TA5",
    "4,Ядро термоядерного реактора TA5",
    "2,Хранение энергии",
    "3,Гибридное хранилище TA5 (планируется)",
    "2,Логические блоки",
    "2,Транспорт и дорожное движение",
    "3,Контроллер полета TA5",
    "3,Сундук TA5 Hyperloop",
    "3,TA5 Hyperloop Танк",
    "2,Блоки телепортации",
    "3,TA5 Блок телепортации предметов",
    "3,TA5 Телепорт Блок Жидкости",
    "3,Блоки телепорта Hyperloop (планируется)",
    "2,Больше блоков/предметов TA5",
    "3,Контейнер TA5 (планируется)",
    "3,TA5 Чип искусственного интеллекта",
    "3,TA5 AI Чип II",
  },
  texts = {
    "Машины для преодоления пространства и времени\\, новые источники энергии и другие достижения формируют вашу жизнь.\n"..
    "\n"..
    "Для производства и использования машин и блоков TA5 требуются очки опыта. Их можно разработать только с помощью коллайдера из TA4.\n"..
    "\n"..
    "\n"..
    "\n",
    "",
    "Ядерный синтез означает слияние двух атомных ядер. В зависимости от реакции может выделяться большое количество энергии. Ядерные синтезы\\, при которых выделяется энергия\\, происходят в форме цепных реакций. Они являются источником энергии звезд\\, включая\\, например\\, наше Солнце. Термоядерный реактор преобразует энергию\\, выделяющуюся в ходе управляемого ядерного синтеза\\, в электричество.\n"..
    "\n"..
    "*Как работают термоядерные реакторы?*\n"..
    "\n"..
    "Термоядерный реактор работает по классическому принципу тепловой электростанции: вода нагревается и приводит в действие паровую турбину\\, кинетическая энергия которой преобразуется генератором в электрическую.\n"..
    "\n"..
    "Термоядерная электростанция изначально требует большого количества энергии\\, поскольку должна быть создана плазма. «Плазма» — это название четвертого состояния вещества после твердого\\, жидкого и газообразного. Это требует большого количества электроэнергии. Только благодаря этой экстремальной концентрации энергии зажигается реакция синтеза\\, а выделяемое тепло используется для выработки электроэнергии через теплообменник. Затем генератор выдает 800 ку электроэнергии.\n"..
    "\n"..
    "На плане справа показан разрез термоядерного реактора.\n"..
    "\n"..
    "Для работы термоядерного реактора требуется 60 очков опыта. Термоядерный реактор должен быть полностью построен в области силового блока.\n"..
    "\n"..
    "\n"..
    "\n",
    "Для установки термоядерного реактора требуется в общей сложности 60 магнитов термоядерного реактора TA5. Они образуют кольцо\\, в котором формируется плазма. Магниты термоядерного реактора TA5 требуют питания и имеют два порта для охлаждения.\n"..
    "\n"..
    "Существует два типа магнитов\\, поэтому все стороны магнита\\, обращенные к плазменному кольцу\\, также могут быть защищены теплозащитным экраном.\n"..
    "\n"..
    "При наличии угловых магнитов на внутренней стороне кольца одна сторона соединения закрыта (питание или охлаждение) и поэтому не может быть подключена. Это технически невыполнимо и\\, следовательно\\, не влияет на работу термоядерного реактора.\n"..
    "\n"..
    "\n"..
    "\n",
    "Насос необходим для заполнения контура охлаждения изобутаном. Требуется около 350 единиц изобутана.\n"..
    "\n"..
    "Примечание: Насос TA5 можно использовать только для заполнения контура охлаждения\\, откачка охлаждающей жидкости невозможна. Поэтому насос не следует включать\\, пока магниты не будут правильно установлены и все линии питания и охлаждения не будут подключены.\n"..
    "\n"..
    "\n"..
    "\n",
    "Теплообменник TA5 необходим для преобразования тепла\\, вырабатываемого в термоядерном реакторе\\, сначала в пар\\, а затем в электричество. Сам теплообменник требует 5 ку электроэнергии. Структура аналогична теплообменнику энергохранилища из TA4.\n"..
    "\n"..
    "Примечание: Теплообменник TA5 имеет два соединения (синее и зеленое) для контура охлаждения. Теплообменник и все магниты должны быть подключены для формирования контура охлаждения через зеленые и синие трубы.\n"..
    "\n"..
    "Проверить целостность контура охлаждения можно с помощью кнопки запуска на теплообменнике\\, даже если охлаждающая жидкость еще не залита.\n"..
    "\n"..
    "\n"..
    "\n",
    "Включение термоядерного реактора осуществляется через контроллер термоядерного реактора TA5. Сначала необходимо включить охлаждение/теплообменник\\, а затем контроллер. Для запуска реактора и подачи электроэнергии требуется около 2 минут. Термоядерному реактору и\\, следовательно\\, контроллеру требуется 400 ку электроэнергии для поддержания плазмы.\n"..
    "\n"..
    "\n"..
    "\n",
    "Весь реактор должен быть окружен оболочкой\\, которая поглощает огромное давление\\, которое магниты оказывают на плазму\\, и защищает окружающую среду от радиации. Без этой оболочки реактор не может быть запущен. С помощью TechAge Trowel силовые кабели и охлаждающие трубы термоядерного реактора также могут быть интегрированы в оболочку.\n"..
    "\n"..
    "\n"..
    "\n",
    "Ядро должно располагаться в центре реактора. См. иллюстрацию под \"TA5 Fusion Reactor\". Для этого также требуется TechAge Trowel.\n"..
    "\n"..
    "\n"..
    "\n",
    "",
    "",
    "",
    "",
    "Контроллер полета TA5 похож на контроллер перемещения TA4. В отличие от контроллера перемещения TA4\\, несколько движений можно объединить в один маршрут полета. Этот маршрут полета можно определить в поле ввода с помощью нескольких записей x\\, y\\, z (одно движение на строку). Маршрут полета проверяется и сохраняется с помощью «Сохранить». В случае ошибки выдается сообщение об ошибке.\n"..
    "\n"..
    "Кнопкой «Тест» маршрут полета с абсолютными координатами выводится для проверки в чате.\n"..
    "\n"..
    "Максимальная дальность полета на всем протяжении составляет 1500 м. Можно обучить до 32 блоков.\n"..
    "\n"..
    "Для использования контроллера полета TA5 требуется 40 очков опыта.\n"..
    "\n"..
    "*Режим телепортации*\n"..
    "\n"..
    "Если включен режим «Телепортации»\\, игрока можно перемещать и без блоков. Для этого необходимо настроить начальную позицию с помощью кнопки «Запись». Здесь можно настроить только одну позицию. Перемещаемый игрок должен находиться в этой позиции.\n"..
    "\n"..
    "\n"..
    "\n",
    "Контейнер TA5 Hyperloop позволяет транспортировать предметы по сети Hyperloop.\n"..
    "\n"..
    "Сундук TA5 Hyperloop Chest должен быть размещен на Hyperloop Junction. Сундук имеет специальное меню\\, с помощью которого можно объединить два сундука. Вещи\\, находящиеся в сундуке\\, телепортируются на удаленную станцию. Сундук также можно наполнять/опустошать с помощью толкателя.\n"..
    "\n"..
    "Для сопряжения вам сначала нужно ввести название сундука с одной стороны\\, затем вы можете выбрать это название для другого сундука и таким образом соединить два блока.\n"..
    "\n"..
    "Для использования сундука TA5 Hyperloop требуется 15 очков опыта.\n"..
    "\n"..
    "\n"..
    "\n",
    "Резервуар TA5 Hyperloop позволяет транспортировать жидкости по сети Hyperloop.\n"..
    "\n"..
    "Резервуар TA5 Hyperloop должен быть размещен на Hyperloop Junction. Резервуар имеет специальное меню\\, с помощью которого вы можете соединить два резервуара. Жидкости в резервуаре будут телепортированы на удаленную станцию. Резервуар также можно наполнять/опорожнять с помощью насоса.\n"..
    "\n"..
    "Для сопряжения сначала необходимо ввести название резервуара с одной стороны\\, затем можно выбрать это название для другого резервуара и таким образом соединить два блока.\n"..
    "\n"..
    "Для использования танка TA5 Hyperloop требуется 15 очков опыта.\n"..
    "\n"..
    "\n"..
    "\n",
    "Блоки телепортации позволяют переносить вещи между двумя блоками телепортации без необходимости использования трубы или трубки между ними. Чтобы спарить блоки\\, сначала нужно ввести имя для блока с одной стороны\\, затем можно выбрать это имя для другого блока и таким образом соединить два блока. Спаривание может быть выполнено только одним игроком (имя игрока проверяется) и должно быть завершено до перезапуска сервера. В противном случае данные спаривания будут утеряны.\n"..
    "\n"..
    "На карте справа показано\\, как можно использовать блоки.\n"..
    "\n"..
    "\n"..
    "\n",
    "Эти телепортационные блоки позволяют переносить предметы и таким образом заменяют трубу. Можно преодолеть расстояние до 500 блоков.\n"..
    "\n"..
    "Каждый блок телепорта требует 12 ку электроэнергии.\n"..
    "\n"..
    "Для использования телепортационных блоков требуется 30 очков опыта.\n"..
    "\n"..
    "\n"..
    "\n",
    "Эти телепортационные блоки позволяют переносить жидкости и таким образом заменяют трубу. Можно преодолеть расстояние до 500 блоков.\n"..
    "\n"..
    "Каждый блок телепорта требует 12 ку электроэнергии.\n"..
    "\n"..
    "Для использования телепортационных блоков требуется 30 очков опыта.\n"..
    "\n"..
    "\n"..
    "\n",
    "Блоки телепорта Hyperloop позволяют построить сеть Hyperloop без труб Hyperloop.\n"..
    "\n"..
    "Для использования телепортационных блоков Hyperloop требуется 60 очков опыта.\n"..
    "\n",
    "",
    "Контейнер TA5 позволяет упаковывать и распаковывать системы Techage в другом месте.\n"..
    "\n"..
    "Для использования контейнера TA5 требуется 80 очков опыта.\n"..
    "\n",
    "TA5 AI Chip частично требуется для производства блоков TA5. TA5 AI Chip может быть изготовлен только на фабрике электроники TA4. Для этого требуется 10 очков опыта.\n"..
    "\n"..
    "\n"..
    "\n",
    "Для создания реактора TA5 Fusion Reactor требуется чип TA5 AI Chip II. Чип TA5 AI Chip II можно изготовить только на заводе электроники TA4. Для этого требуется 25 очков опыта.\n"..
    "\n"..
    "\n"..
    "\n",
  },
  images = {
    "techage_ta5",
    "",
    "",
    "ta5_magnet",
    "ta5_pump",
    "",
    "ta5_fr_controller",
    "ta5_fr_shell",
    "ta5_fr_nucleus",
    "",
    "",
    "",
    "",
    "ta5_flycontroller",
    "ta5_chest",
    "ta5_tank",
    "",
    "ta5_tele_tube",
    "ta5_tele_pipe",
    "",
    "",
    "",
    "ta5_aichip",
    "ta5_aichip2",
  },
  plans = {
    "",
    "",
    "ta5_fusion_reactor",
    "",
    "",
    "ta5_heatexchanger",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "ta5_teleport",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
  }
}