return {
  titles = {
    "1,TA3: Нефтяной век",
    "2,Угольная электростанция / Нефтяная электростанция",
    "3,TA3 Угольная топка электростанции",
    "3,TA3 Нефтяная топка электростанции",
    "3,TA3 Котел",
    "3,TA3 Турбина",
    "3,TA3 Генератор",
    "3,TA3 Охладитель",
    "2,Электрический ток",
    "3,Важность систем накопления энергии",
    "3,TA Электрический кабель",
    "3,TA Электросоединитель",
    "3,TA Линия электропередачи",
    "3,TA Столб",
    "3,TA Верхушка столба",
    "3,TA Верхушка столба 2",
    "3,ТА Выключатель",
    "3,TA Выключатель мини",
    "3,TA Коробка выключателя",
    "3,TA3 Портативный генератор",
    "3,TA3 Аккумулятор",
    "3,TA3 Терминал электросети",
    "3,TA3 Электродвигатель",
    "2,TA3 Промышленная печь",
    "3,TA3 Нефтяная горелка",
    "3,TA3 Верхняя часть печи",
    "3,TA3 Нагнетатель",
    "2,Жидкости",
    "3,TA3 Резервуар",
    "3,TA3 Насос",
    "3,TA Наливное устройство",
    "3,TA3 Труба",
    "3,TA3 Труба в стене",
    "3,TA Вентиль",
    "2,Добыча нефти",
    "3,TA3 Нефтяной сонар",
    "3,TA3 Буровая установка",
    "3,TA3 Нефтекачка",
    "3,TA3 Бурильная труба",
    "3,Нефтяной резервуар",
    "2,Транспортировка нефти",
    "3,Транспортировка нефти вагонетками",
    "3,Транспортировка нефти с помощью бочек по сравнению с Minecarts",
    "3,Вагонетка-цистерна",
    "3,Вагонетка-сундук",
    "2,Переработка нефти",
    "3,Дистилляционная колонна",
    "4,Нефтяной нагреватель",
    "2,Логические/коммутационные блоки",
    "3,TA3 Кнопка / переключатель",
    "3,TA3 Преобразователь команд",
    "3,TA3 Триггер",
    "3,TA3 Логический блок",
    "3,TA3 Повторитель",
    "3,TA3 Секвенсор",
    "3,TA3 Таймер",
    "3,TA3 Терминал",
    "3,TechAge Цветная лампа",
    "3,Блоки дверей и ворот",
    "3,TA3 Контроллер дверей",
    "3,TA3 Контроллер дверей II",
    "3,TA3 Звуковой блок",
    "3,TA3 Преобразователь Mesecons",
    "2,Детекторы",
    "3,TA3 Детектор предметов",
    "3,TA3 Детектор вагонетки",
    "3,TA3 Детектор блоков",
    "3,TA3 Детектор игроков",
    "3,TA3 Детектор света",
    "2,TA3 Машины",
    "3,TA3 Толкатель",
    "3,TA3 Распределитель",
    "3,TA3 Автокрафтер",
    "3,TA3 Фабрика электроники",
    "3,TA3 Карьер",
    "3,TA3 Просеиватель",
    "3,TA3 Промыватель",
    "3,TA3 Измельчитель",
    "3,TA3 Инжектор",
    "2,Инструменты",
    "3,TechAge Гаечный ключ",
    "3,TechAge Программатор",
    "3,TechAge Мастерок",
    "3,TA3 Ключ для буровых труб",
    "3,TechAge Отвертка",
    "3,TechAge Инструмент для сборки",
  },
  texts = {
    "В TA3 важно заменить машины с паровым двигателем на более мощные машины с электрическим двигателем.\n"..
    "\n"..
    "Для этого вам придется построить электростанции и генераторы\\, работающие на угле. Вскоре вы увидите\\, что ваши потребности в электричестве можно удовлетворить только с помощью электростанций\\, работающих на нефти. Поэтому вам надо отправлятся на поиски нефти. Буровые вышки и нефтяные насосы помогают добывать нефть. Для транспортировки нефти к электростанции(ям) используются железные дороги.\n"..
    "\n"..
    "Индустриальная эпоха достигла своего пика.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Угольная электростанция состоит из нескольких блоков и должна быть собрана\\, как показано на плане справа. Для этого необходимы блоки: TA3 \"Топка электростанции\"\\, TA3 \"Верх котла\"\\, TA3 \"Основание котла\"\\, TA3 \"Турбина\"\\, TA3 \"Генератор\" и TA3 \"Охладитель\".\n"..
    "\n"..
    "Котел должен быть заполнен водой. Залить в котел можно до 10 ведер воды или подключить жидкостную трубу к верхней части котла для автоматической подачи воды через насос.\n"..
    "Топочный ящик должен быть заполнен углем или древесным углем.\n"..
    "Когда вода нагреется\\, запускается генератор.\n"..
    "\n"..
    "В качестве альтернативы электростанция может быть оснащена нефтяной горелкой и работать на нефтепродуктах.\n"..
    "Нефть и нефтепродукты можно доливать с помощью насоса и труб.\n"..
    "\n"..
    "Мощность электростанции составляет 80 ku.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Часть электростанции.\n"..
    "В топку необходимо засыпать уголь или древесный уголь. Время горения зависит от мощности\\, которую запрашивает электростанция. Уголь горит 20 с\\, а древесный уголь - 60 с при полной нагрузке. Соответственно дольше при частичной нагрузке (50% нагрузки = увеличение длительности горения вдвое).\n"..
    "\n"..
    "\n"..
    "\n",
    "Часть электростанции.\n"..
    "\n"..
    "В нефтяную топку можно заливать сырую нефть\\, мазут\\, нафту или бензин. Время горения зависит от мощности\\, которую запрашивает электростанция. При полной нагрузке сырая нефть горит 15 с\\, мазут - 20 с\\, лигроин - 22 с\\, а бензин - 25 с.\n"..
    "\n"..
    "Соответственно дольше при частичной нагрузке (50% нагрузки = увеличение длительности горения вдвое).\n"..
    "\n"..
    "Нефтяная горелка вмещает только 50 единиц топлива. Поэтому целесообразно установить дополнительный бак для масла и насос.\n"..
    "\n"..
    "\n"..
    "\n",
    "Часть электростанции. Должен быть заполнен водой. Если воды больше нет или температура падает слишком низко\\, электростанция отключается.\n"..
    "\n"..
    "Котел можно заполнять водой двумя способами:\n"..
    "\n"..
    "  - Вручную\\, нажав на верхнюю часть котла ведром с водой (до 10 ведер)\n"..
    "  - Автоматически через жидкостную трубу\\, подключенную к верхней части котла\\, с помощью насоса TA3/TA4\n"..
    "\n"..
    "Расход воды в котле TA3 значительно ниже\\, чем в паровом двигателе\\, благодаря замкнутому паровому контуру.\n"..
    "В паровом двигателе часть воды теряется в виде пара при каждом ходе поршня.\n"..
    "\n"..
    "\n"..
    "\n",
    "Турбина является частью электростанции. Она должна быть расположена рядом с генератором и соединена с котлом и охладителем через паровые трубы\\, как показано на плане.\n"..
    "\n"..
    "\n"..
    "\n",
    "Генератор используется для выработки электроэнергии. Он должен быть подключен к машинам с помощью силовых кабелей и распределительных коробок.\n"..
    "\n"..
    "\n"..
    "\n",
    "Используется для охлаждения горячего пара из турбины. Должен быть подключен к котлу и турбине через паровые трубы\\, как показано на плане.\n"..
    "\n"..
    ".\n"..
    "\n",
    "В TA3 (и TA4) машины питаются от электричества. Для этого машины\\, системы накопления энергии и генераторы должны быть соединены силовыми кабелями.\n"..
    "TA3 имеет 2 типа силовых кабелей:\n"..
    "\n"..
    "  - Изолированные кабели (силовые кабели TA) для локальной проводки в полу или в зданиях. Эти кабели могут быть скрыты в стене или в полу (могут быть \"заштукатурены\" с помощью мастерка).\n"..
    "  - Сухопутные линии (линия электропередач TA) для прокладки кабелей вне помещений на большие расстояния. Эти кабели защищены и не могут быть сломанны другими игроками.\n"..
    "\n"..
    "Несколько потребителей\\, систем накопления энергии и генераторов могут работать вместе в электрической сети. Сети можно создавать с помощью распределительных коробок.\n"..
    "Если электричества будет слишком мало\\, потребители остановятся.\n"..
    "В этом контексте также важно понимать функциональность блоков загрузки карты\\, поскольку\\, например\\, генераторы подают электричество только тогда\\, когда загружен соответствующий блок карты. Это можно обеспечить с помощью блока загрузки карты (Forceload).\n"..
    "\n"..
    "В TA4 также есть низковольтный кабель для солнечной системы.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Системы накопления энергии в энергосистеме выполняют две задачи:\n"..
    "\n"..
    "  - Чтобы справляться с пиками спроса: Все генераторы всегда выдают ровно столько энергии\\, сколько необходимо. Однако при включении/выключении потребителей или при колебаниях спроса по другим причинам потребители могут на короткое время выйти из строя. Чтобы предотвратить это\\, в каждой сети всегда должен быть хотя бы один батарейный блок. Он служит буфером и компенсирует эти колебания в диапазоне секунд.\n"..
    "  - Для накопления возобновляемой энергии: Солнечная и ветровая энергия не доступна 24 часа в сутки. Чтобы не допустить перебоев в подаче электроэнергии\\, когда она не производится\\, в сети необходимо установить одну или несколько систем накопления энергии. В качестве альтернативы пробелы можно восполнить за счет электроэнергии\\, получаемой от нефти или угля.\n"..
    "\n"..
    "Система накопления энергии указывает свою емкость в kud\\, то есть в ku в день. Например\\, система хранения с емкостью 100 kud обеспечивает 100 ku в течение одного игрового дня или 10 ku в течение 10 игровых дней.\n"..
    "\n"..
    "Все источники энергии TA3/TA4 имеют регулируемые характеристики зарядки. По умолчанию она установлена на \"80 % - 100 %\". Это означает\\, что когда система хранения заполнена на 80 %\\, мощность снижается все больше и больше\\, пока не выключится полностью на 100 %. Если в сети требуется электроэнергия\\, 100% никогда не будет достигнуто\\, так как мощность генератора в какой-то момент снизится до уровня потребности в электроэнергии в сети\\, и система хранения больше не будет заряжаться\\, а будут обслуживаться только потребители.\n"..
    "\n"..
    "Это имеет ряд преимуществ:\n"..
    "\n"..
    "  - Характеристики зарядки можно регулировать. Это означает\\, что\\, например\\, расход нефти/угля может быть снижен на 60 %\\, а регенеративных источников энергии - только на 80 %. Это означает\\, что нефть/уголь сжигается только в том случае\\, если не хватает возобновляемых источников энергии.\n"..
    "  - Несколько источников энергии могут работать параллельно и загружены практически равномерно\\, поскольку все источники энергии работают\\, например\\, до 80% зарядной емкости системы хранения на полную мощность\\, а затем одновременно снижают свою мощность.\n"..
    "  - Все системы хранения в сети образуют большой буфер. Зарядная емкость и уровень заполнения всей системы хранения всегда можно считать в процентах на каждой системе хранения\\, а также на терминале электроэнергии.\n"..
    "\n"..
    "\n"..
    "\n",
    "Для локальной электропроводки в полу или в стенах зданий.\n"..
    "Разветвления могут быть реализованы с помощью распределительных коробок. Максимальная длина кабеля между машинами или распределительными коробками составляет 1000 м. В силовую сеть можно подключить не более 1000 узлов. Все блоки с силовым подключением\\, включая распределительные коробки\\, считаются узлами.\n"..
    "\n"..
    "Поскольку силовые кабели не имеют автоматической защиты\\, для больших расстояний рекомендуется использовать наземные линии (линия электропередачи TA).\n"..
    "\n"..
    "Силовые кабели можно заштукатурить с помощью мастерка\\, чтобы спрятать их в стене или в полу. В качестве штукатурного материала можно использовать любые каменные\\, глиняные и другие блоки\\, не обладающие \"интеллектом\". Земля не подходит\\, потому что земля может превратиться в траву и тому подобное\\, что разрушит линию.\n"..
    "\n"..
    "Для нанесения штукатурки необходимо кликнуть на кабель мастерком. Материал\\, которым будет заштукатурен кабель\\, должен находиться слева в быстрых слотах игрока.\n"..
    "Кабели можно снова сделать видимыми\\, нажав на блок с лопаткой.\n"..
    "\n"..
    "Помимо кабелей\\, можно также заштукатурить TA Электросоединитель и TA коробку выключателя электропитания.\n"..
    "\n"..
    ".\n"..
    "\n",
    "С помощью соединителя можно распределить электричество в 6 направлениях. Соединители также можно заштукатурить (спрятать) с помощью мастерка и снова сделать видимыми.\n"..
    "\n"..
    ".\n"..
    "\n",
    "С помощью TA линии электропередачи и электрических столбов можно реализовать достаточно реалистичные воздушные линии. Опоры столбов также служат для защиты линии электропередачи (защита). Столбы должны быть установлены через каждые 16 м или менее. Защита распространяется только на линию электропередачи и столбы\\, однако все остальные блоки в этой области не защищены.\n"..
    "\n"..
    "\n"..
    "\n",
    "Используется для строительства столбов электропередач. Защищен от разрушения верхушкой столба и может быть убран только владельцем.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Имеет до четырех креплений провода\\, что позволяет распределять электричество в 6 направлениях.\n"..
    "верхушка для столбов защищает линии электропередач и столбы в радиусе 8 м.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Эта верхушка электрического столба имеет два фиксированных крепления провода и используется для воздушных линий. Однако она также может передавать ток вниз и вверх.\n"..
    "верхушка для столбов защищает линии электропередач и столбы в радиусе 8 м.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Выключатель можно использовать для включения и выключения питания. Для этого выключатель должен быть установлен на коробке выключателя питания. Коробка силового выключателя должна быть подключена к силовому кабелю с обеих сторон.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Переключатель можно использовать для включения и выключения питания. Для этого переключатель должен быть установлен на коробке переключателя питания. Коробка силового переключателя должна быть подключена к силовому кабелю с обеих сторон.\n"..
    "\n"..
    "\n"..
    "\n",
    "см. переключатель питания TA.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Портативный генератор работает на бензине и может использоваться для небольших потребителей мощностью до 12 ku. При полной нагрузке бензин сгорает в течение 150 с. Соответственно дольше при частичной нагрузке (50% нагрузки = увеличение длительности горения в два раза).\n"..
    "\n"..
    "Портативный генератор вмещает только 50 единиц бензина. Желательно установить дополнительный бак и насос.\n"..
    "\n"..
    "\n"..
    "\n",
    "Аккумулятор используется для накопления избыточной энергии и автоматически подает энергию в случае отключения питания при ее наличии.\n"..
    "Несколько аккумуляторов вместе образуют систему хранения энергии TA3. На каждом блоке есть индикатор состояния зарядки и накопленной нагрузки.\n"..
    "Здесь всегда отображаются значения для всей сети. Накопленная энергия отображается в kud или \"ku-днях\" (аналогично кВт-ч). 5 kud соответствует\\, например\\, 5 ku за игровой день (20 минут) или 1 ku за 5 игровых дней.\n"..
    "\n"..
    "Аккумулятор имеет емкость 3\\,33 kud\n"..
    "\n"..
    ".\n"..
    "\n",
    "Терминал электросети должен быть подключен к электросети. На нем отображаются данные из электросети.\n"..
    "\n"..
    "Наиболее важные показатели отображаются в верхней половине:\n"..
    "\n"..
    "  - ток/максимальная мощность генератора\n"..
    "  - текущее энергопотребление всех потребителей\n"..
    "  - текущий зарядный ток в/из системы хранения\n"..
    "  - Текущее состояние заряда системы хранения в процентах\n"..
    "\n"..
    "В нижней половине выводится количество устройств в сети.\n"..
    "\n"..
    "Дополнительные данные о генераторах и системах хранения можно запросить на вкладке \"Консоль\".\n"..
    "\n"..
    ".\n"..
    "\n",
    "Электродвигатель TA3 необходим для того\\, чтобы машины TA2 могли работать от электросети. Электродвигатель TA3 преобразует электричество в мощность оси.\n"..
    "Если на электродвигатель не подается достаточная мощность\\, он переходит в состояние неисправности и должен быть снова активирован щелчком правой кнопки мыши.\n"..
    "\n"..
    "Электродвигатель потребляет макс. 40 ku электроэнергии и обеспечивает макс. 39 ku в качестве мощности оси. Таким образом\\, он расходует один ku на преобразование.\n"..
    "\n"..
    "\n"..
    "\n",
    "Промышленная печь TA3 служит дополнением к обычным печам. Это означает\\, что все товары можно производить по рецептам \"варки\" даже в промышленной печи. Но есть и особые рецепты\\, которые можно получить только от промышленной печи.\n"..
    "Промышленная печь имеет собственное меню для выбора рецепта. В зависимости от того\\, какие ресурсы находятся в инвентаре промышленной печи слева\\, справа можно выбрать выходной продукт.\n"..
    "\n"..
    "Промышленная печь требует электричества (для нагнетателя) и мазута/бензина для горелки. Промышленная печь должна быть собрана\\, как показано на плане справа.\n"..
    "\n"..
    "См. также нагреватель TA4.\n"..
    "\n"..
    "\n"..
    "\n",
    "Является частью промышленной печи TA3.\n"..
    "\n"..
    "Нефтяная горелка может работать на сырой нефти\\, мазуте\\, нафте или бензине. Время горения составляет 64 с для сырой нефти\\, 80 с для мазута\\, 90 с для нафты и 100 с для бензина.\n"..
    "\n"..
    "Нефтяная горелка вмещает только 50 единиц топлива. Желательно установить дополнительный бак и насос.\n"..
    "\n"..
    "\n"..
    "\n",
    "Является частью TA3 промышленной печи. См. промышленную печь TA3.\n"..
    "\n"..
    "\n"..
    "\n",
    "Является частью промышленной печи TA3. См. промышленную печь TA3.\n"..
    "Служит для нагнетания воздуха в топку.\n"..
    "\n"..
    "\n"..
    "\n",
    "Жидкости\\, такие как вода или нефть\\, можно перекачивать только по специальным трубам и хранить в резервуарах. Как и в случае с водой\\, существуют емкости (канистры\\, бочки)\\, в которых жидкость можно хранить и перевозить.\n"..
    "\n"..
    "С помощью желтых труб и соединителей можно также соединить несколько резервуаров. Однако резервуары должны иметь одинаковое содержимое\\, а между резервуаром\\, насосом и распределительной трубой всегда должна быть хотя бы одна желтая труба.\n"..
    "\n"..
    "Например\\, невозможно подключить два резервуара непосредственно к распределительной трубе.\n"..
    "\n"..
    "Наливное устройство используется для переливания жидкостей из контейнеров в резервуары. На плане показано\\, как канистры или бочки с жидкостями с помощью толкателей заталкиваются в наливное устройство. Контейнер опорожняется в наливном устройстве\\, и жидкость спускается в резервуар.\n"..
    "\n"..
    "Наливное устройство также можно поместить под резервуар\\, чтобы опорожнить его.\n"..
    "\n"..
    "\n"..
    "\n",
    "Жидкости можно хранить в резервуаре. Резервуар можно наполнить или опорожнить с помощью насоса. Для этого насос должен быть подключен к резервуару через трубу (желтые трубы).\n"..
    "\n"..
    "Резервуар также можно заполнить или опустошить вручную\\, щелкнув по нему с полным или пустым контейнером для жидкости (бочкой\\, канистрой). Следует отметить\\, что бочки могут быть заполнены или опустошены только полностью. Если\\, например\\, в резервуаре осталось менее 10 единиц\\, этот остаток необходимо удалить с помощью канистр или выкачать до пустоты.\n"..
    "\n"..
    "Цистерна TA3 вмещает 1000 единиц или 100 бочек жидкости.\n"..
    "\n"..
    "\n"..
    "\n",
    "Насос можно использовать для перекачивания жидкостей из резервуаров или контейнеров в другие резервуары или контейнеры. При работе насоса необходимо соблюдать направление (стрелка). Желтые линии и соединители также позволяют устанавливать несколько резервуаров с каждой стороны насоса. Однако резервуары должны иметь одинаковое содержимое.\n"..
    "\n"..
    "Насос TA3 перекачивает 4 единицы жидкости каждые две секунды.\n"..
    "\n"..
    "Примечание 1: Насос не должен располагаться непосредственно рядом с резервуаром. Между ними всегда должен быть как минимум кусок желтой трубы.\n"..
    "\n"..
    "\n"..
    "\n",
    "Наливное устройство используется для перекачки жидкостей между емкостями и резервуарами.\n"..
    "\n"..
    "  - Если наливное устройство находится под резервуаром\\, а пустые бочки помещаются в наливное устройство с помощью толкателя или вручную\\, содержимое резервуара переливается в бочки\\, и бочки можно извлечь из выпускного отверстия.\n"..
    "  - Если наливное устройство установлено на резервуаре\\, а полные контейнеры помещаются в наливное устройство с помощью толкателя или вручную\\, содержимое переливается в резервуар\\, а пустые контейнеры могут быть удалены со стороны выхода\n"..
    "\n"..
    "Следует отметить\\, что бочки могут быть заполнены или опустошены только полностью. Если\\, например\\, в резервуаре осталось менее 10 единиц\\, этот остаток необходимо удалить с помощью канистр или откачать пустым насосом.\n"..
    "\n"..
    "\n"..
    "\n",
    "Желтые трубы используются для передачи газа и жидкостей.\n"..
    "Максимальная длина трубы - 100 м.\n"..
    "\n"..
    "\n"..
    "\n",
    "Блоки служат для скрытого проведения в стенах труб.\n"..
    "\n"..
    "\n"..
    "\n",
    "Для желтых труб предусмотрен вентиль\\, который можно открывать и закрывать одним щелчком мыши.\n"..
    "Управление вентилем также может осуществляться с помощью команд включения/выключения (см. TA3 Терминал).\n"..
    "\n"..
    "\n"..
    "\n",
    "Для того чтобы генераторы и печи работали на нефти\\, вам нужно сначала найти нефть. А после этого надо построить вышку\\, а затем добыть ее.\n"..
    "Для этого используются TA3 Нефтяной сонар\\, TA3 буровая установка и TA3 Нефтяной насос.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Вы можете искать нефть с помощью нефтяного сонара. Для этого поставьте блок на пол/грунт/землю и щелкните правой кнопкой мыши\\, чтобы начать поиск. Нефтяной сонар использовать как над землей\\, так и под землей на любой глубине.\n"..
    "В чате отображается информация о глубине поиска нефти и количестве найденной нефти (петролеума).\n"..
    "Вы можете нажимать на блок несколько раз\\, чтобы искать нефть в более глубоких областях. Размер нефтяных месторождений варьируется от 4 000 до 20 000 единиц.\n"..
    "\n"..
    "Если поиски не увенчались успехом\\, необходимо передвинуть блок на 16 м дальше.\n"..
    "Нефтяной сонар всегда ищет нефть во всем блоке карты и ниже\\, в котором он был установлен. Поэтому новый поиск в том же блоке карты (поле 16x16) не имеет смысла.\n"..
    "\n"..
    "Если нефть найдена\\, на экране появится место для установки буровой вышки. Вы должны возвести буровую вышку в пределах указанной области\\, лучше всего отметить место знаком и защитить всю территорию от посторонних игроков.\n"..
    "\n"..
    "Не отказывайтесь от поисков нефти слишком быстро. Если вам не повезет\\, поиск нефти может занять много времени.\n"..
    "Также не имеет смысла искать нефть в зоне\\, которую уже обыскал другой игрок. Шанс найти нефть в любом месте одинаков для всех игроков.\n"..
    "\n"..
    "\n"..
    "\n",
    "Буровая установка должна быть установлена в месте\\, указанном нефтеразведчиком. Бурить нефть в другом месте бессмысленно.\n"..
    "Если нажать кнопку на коробке с нефтяным буром\\, над ней будет возведена вышка. Это занимает несколько секунд.\n"..
    "Буровая установка имеет 4 стороны\\, в IN подается бурильная труба через толкатель\\, а в OUT вылетает буровой материал. Через одну из двух свободных сторон на буровую установку должно подаваться питание.\n"..
    "\n"..
    "Буровая установка бурит до нефтяного месторождения (1 метр за 16 с) и требует 16 ku электроэнергии.\n"..
    "После достижения нефтяного месторождения установка может быть разобрана\\, а блок убран.\n"..
    "\n"..
    "\n"..
    "\n",
    "Теперь на место буровой установки необходимо установить нефтекачку (pump-jack). нефтекачка также требует электричество (16 ku) и подает одну единицу нефти каждые 8 с. Нефть должна собираться в резервуар. Для этого нужно соединить нефтекачку с резервуаром с помощью желтых труб.\n"..
    "После того как все нефть будет выкачана\\, можно снять и саму нефтекачку.\n"..
    "\n"..
    "\n"..
    "\n",
    "Для бурения требуется столько труб\\, на какую глубину рассчитано нефтяное месторождение. После бурения труба становится бесполезной\\, но ее также нельзя демонтировать\\, и она остается в земле. Однако существует инструмент для извлечения бурильных труб (-> Инструменты -> TA3 ключ для бурильных труб).\n"..
    "\n"..
    "\n"..
    "\n",
    "Нефтяной резервуар - это большая версия TA3 Резервуара (см. Жидкости -> TA3 Резервуар).\n"..
    "\n"..
    "Большой резервуар вмещает 4000 единиц нефти\\, а также любые другие виды жидкостей.\n"..
    "\n"..
    ".\n"..
    "\n",
    "",
    "Вагонетки-цистерны могут использоваться для транспортировки нефти от нефтяной скважины до нефтеперерабатывающего завода. Вагонетку-цистерну можно наполнять или опорожнять непосредственно с помощью насосов. В обоих случаях желтые трубы должны быть подсоединены к вагонетке-цистерне сверху.\n"..
    "\n"..
    "Необходимо выполнить следующие действия:\n"..
    "\n"..
    "  - Установите вагонетку-цистерну перед рельсовым бамперным блоком. Блок бампера еще не должен быть запрограммирован на время\\, чтобы вагонетка-цистерна не запустилась автоматически\n"..
    "  - Подключите вагонетку с цистерной к насосу с помощью желтых труб\n"..
    "  - Включите насос\n"..
    "  - Запрограммируйте бампер на время (10 - 20 с)\n"..
    "\n"..
    "Эта последовательность должна соблюдаться с обеих сторон (накачивание / выкачивание).\n"..
    "\n"..
    "\n"..
    "\n",
    "В Minecart (Далее вагонетки) можно загружать канистры и бочки. Для этого нефть нужно сначала перелить в бочки. Бочки с нефтью можно заталкивать прямо в вагонетку с помощью толкателя и труб (см. карту). Пустые бочки\\, которые возвращаются со станции разгрузки на вагонетке\\, можно выгрузить с помощью бункера\\, который устанавливается под рельсами на остановке.\n"..
    "\n"..
    "С помощью бункера невозможно одновременно *разгрузить пустые бочки и загрузить полные бочки во время остановки*. Бункер сразу же выгружает полные бочки. Поэтому рекомендуется установить 2 станции на стороне загрузки и разгрузки\\, а затем запрограммировать вагонетку соответствующим образом с помощью прогона записи.\n"..
    "\n"..
    "На плане показано\\, как нефть можно закачать в резервуар\\, наполнить бочки через заливное устройство и погрузить в вагонетку.\n"..
    "\n"..
    "Чтобы вагонетки запускались снова автоматически\\, на бамперных блоках необходимо указать название станции и время ожидания. Для разгрузки достаточно 5 с. Однако\\, поскольку толкатели всегда переходят в режим ожидания на несколько секунд при отсутствии вагонетки\\, для загрузки необходимо ввести время 15 или более секунд.\n"..
    "\n"..
    "\n"..
    "\n",
    "Вагонетка-цистерна используется для перевозки жидкостей. Как и цистерны\\, ее можно наполнять с помощью насосов или опорожнять. В обоих случаях желтая труба должна быть подсоединена к автоцистерне сверху.\n"..
    "\n"..
    "В вагонетку-цистерну помещается 200 единиц.\n"..
    "\n"..
    "\n"..
    "\n",
    "Вагонетка-сундук используется для перевозки предметов. Как и сундуки\\, ее можно наполнить или опустошить с помощью толкателя.\n"..
    "\n"..
    "4 стопки помещаются в вагонетку-сундук.\n"..
    "\n"..
    "\n"..
    "\n",
    "Нефть - это смесь веществ\\, состоящая из множества компонентов. С помощью перегонной колонны нефть можно разделить на основные компоненты\\, такие как битум\\, мазут\\, нафта\\, бензин и газ пропан.\n"..
    "Дальнейшая переработка до конечных продуктов происходит в химическом реакторе.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Дистилляционная колонна должна быть установлена так\\, как показано на плане в правом верхнем углу.\n"..
    "Битум сливается через базовый блок. Выход находится на задней стороне базового блока (обратите внимание на направление стрелки).\n"..
    "Блоки \"перегонной башни\" с номерами: 1\\, 2\\, 3\\, 2\\, 3\\, 2\\, 3\\, 4 расположены на этом основном блоке\n"..
    "Мазут\\, нафта и бензин вытекают из отверстий снизу вверх. Газ пропан попадает в верхнее отверстие.\n"..
    "Все отверстия на башне должны быть соединены с резервуарами.\n"..
    "Нефтяной нагреватель должен быть подключен к блоку \"Дистилляционная колонна 1\".\n"..
    "\n"..
    "Нефтяной нагреватель требует электричество (не показано на плане)!\n"..
    "\n"..
    "\n"..
    "\n",
    "В нефтяном нагревателе нефть нагревается примерно до 400 °С. Оно в значительной степени испаряется и поступает в дистилляционную колонну для охлаждения.\n"..
    "\n"..
    "Нефтяной нагреватель требует 14 единиц электроэнергии и производит одну единицу битума\\, мазута\\, нафты\\, бензина и пропана каждые 16 с.\n"..
    "Для этого в нефтяной нагреватель необходимо подавать нефть через насос.\n"..
    "\n"..
    "\n"..
    "\n",
    "Помимо труб для транспортировки грузов\\, а также газо- и электропроводов\\, существует также беспроводной уровень связи\\, с помощью которого блоки могут обмениваться данными друг с другом. Для этого не нужно прокладывать линии\\, связь между передатчиком и приемником осуществляется только через номер блока.\n"..
    "\n"..
    "*Информация:* Номер блока - это уникальный номер\\, который генерируется модом Techage при размещении большого количества блоков Techage. Номер блока используется для адресации при обмене данными между контроллерами Techage и машинами. Все блоки\\, которые могут участвовать в этом общении\\, показывают номер блока в виде информационного текста\\, если вы фиксируете блок курсором мыши.\n"..
    "\n"..
    "Какие команды поддерживает тот или иной блок\\, можно узнать и отобразить с помощью TechAge Info Tool (гаечный ключ).\n"..
    "Простейшие команды\\, поддерживаемые почти всеми блоками:\n"..
    "\n"..
    "  - 'on' - включать блок / машину / лампу\n"..
    "  - 'off' - выключить блок / машину / лампу\n"..
    "\n"..
    "С помощью терминала TA3 эти команды можно легко опробовать. Предположим\\, сигнальная лампа имеет номер 123.\n"..
    "Затем с:\n"..
    "\n"..
    "    cmd 123 on\n"..
    "\n"..
    "лампу можно включать и выключать:\n"..
    "\n"..
    "    cmd 123 off\n"..
    "\n"..
    "лампа может быть снова выключена. Эти команды должны быть введены в поле ввода терминала TA3.\n"..
    "\n"..
    "Такие команды\\, как \"on\" и \"off\"\\, отправляются получателю без ответной реакции. Таким образом\\, эти команды могут быть отправлены нескольким получателям одновременно\\, например\\, с помощью кнопки/выключателя\\, если в поле ввода введено несколько цифр.\n"..
    "\n"..
    "Команда типа 'state' запрашивает статус блока. Затем блок отправляет свой статус обратно. Этот тип подтвержденной команды может быть отправлен только одному получателю одновременно.\n"..
    "Эту команду можно также проверить\\, например\\, с помощью клеммы TA3 на толкателе:\n"..
    "\n"..
    "    cmd 123 state\n"..
    "\n"..
    "Возможные ответы толкателя::\n"..
    "\n"..
    "  - 'running' -> работает\n"..
    "  - 'stopped' -> выключен\n"..
    "  - 'standby' -> ничего не делает\\, потому что исходный инвентарь пуст\n"..
    "  - 'blocked' -> не может ничего сделать\\, потому что инвентарь цели переполнен\n"..
    "\n"..
    "Этот статус и другая информация также выводятся при нажатии гаечного ключа на блок.\n"..
    "\n"..
    "\n"..
    "\n",
    "Кнопка/переключатель посылает команды 'on' / 'off' на блоки\\, которые были сконфигурированы с помощью цифр.\n"..
    "Кнопка/переключатель может быть настроена как кнопка или переключатель. Если она сконфигурирована как кнопка\\, можно установить время между командами 'on' и 'off'. В режиме работы \"button\" (кнопка) передается только команда 'on' и не передается команда 'off'.\n"..
    "\n"..
    "С помощью флажка \"public\" можно установить\\, может ли кнопка использоваться всеми (установлено) или только самим владельцем (не установлено).\n"..
    "\n"..
    "Примечание: С помощью программатора можно легко собирать и настраивать номера блоков.\n"..
    "\n"..
    "\n"..
    "\n",
    "С помощью конвертера команд TA3 команды 'on' / 'off' могут быть преобразованы в другие команды\\, а переадресация может быть предотвращена или отложена.\n"..
    "Необходимо ввести номер целевого блока или номера целевых блоков\\, команды для отправки и время задержки в секундах. Если команда не введена\\, ничего не будет отправлено.\n"..
    "\n"..
    "Номера также можно запрограммировать с помощью программатора Techage.\n"..
    "\n"..
    ".\n"..
    "\n",
    "TA3 Триггер меняет свое состояние при каждой полученной команде 'on'. Полученные команды 'off' игнорируются. В зависимости от изменения состояния\\, команды 'on' / 'off' посылаются поочередно. Необходимо ввести номер целевого блока или номера целевых блоков. Номера также могут быть запрограммированы с помощью Techage программатора.\n"..
    "\n"..
    "Например\\, лампы можно включать и выключать с помощью кнопок.\n"..
    "\n"..
    "\n"..
    "\n",
    "TA3 Логический блок может быть запрограммирован таким образом\\, что одна или несколько входных команд будут связаны с одной выходной командой и отправлены. Таким образом\\, этот блок может заменить различные логические элементы\\, такие как AND (И)\\, OR (ИЛИ)\\, NOT (НЕ)\\, XOR (исключающее ИЛИ) и т. д.\n"..
    "Входными командами для логического блока являются команды 'on' / 'off'.\n"..
    "Входные команды обозначаются номером\\, например\\, '1234' для команды от отправителя с номером 1234.\n"..
    "То же самое относится и к командам вывода.\n"..
    "\n"..
    "Правило имеет следующую структуру:\n"..
    "\n"..
    "    <output> = on/off if <input-expression> is true\n"..
    "\n"..
    "'<output>' - это номер блока\\, в который должна быть отправлена команда.\n"..
    "'<input-expression>' - это булево выражение\\, в котором оцениваются входные числа.\n"..
    "\n"..
    "*Примеры для входного выражения*\n"..
    "\n"..
    "Логическое НЕ:\n"..
    "\n"..
    "    1234 == off.\n"..
    "\n"..
    "Логическое И:\n"..
    "\n"..
    "    1234 == on. and 2345 == on.\n"..
    "\n"..
    "Логическое ИЛИ:\n"..
    "\n"..
    "    1234 == on. or 2345 == on.\n"..
    "\n"..
    "Допустимы следующие операторы:  'and'   'or'   'on'   'off'   'me'   '=='   '~='   '('   ')'\n"..
    "\n"..
    "Если выражение истинно\\, то в блок с номером '<output>' отправляется команда.\n"..
    "Можно задать до четырех правил\\, при этом все правила всегда проверяются при получении команды.\n"..
    "Внутреннее время обработки всех команд составляет 100 мс.\n"..
    "\n"..
    "Ваш собственный номер узла может быть указан с помощью ключевого слова 'me'. Это позволяет блоку посылать самому себе команду (функция флип-флопа).\n"..
    "\n"..
    "Время блокировки определяет паузу после команды\\, в течение которой логический блок не принимает никаких дальнейших внешних команд. Команды\\, полученные в период блокировки\\, отбрасываются. Время блокировки может быть задано в секундах.\n"..
    "\n"..
    "\n"..
    "\n",
    "Повторитель отправляет полученный сигнал на все настроенные номера.\n"..
    "Это может иметь смысл\\, например\\, если вы хотите управлять несколькими блоками одновременно. Повторитель можно настроить с помощью программатора\\, что возможно не для всех блоков.\n"..
    "\n"..
    "\n"..
    "\n",
    "Секвенсор может посылать серию команд 'вкл' / 'выкл'\\, при этом интервал между командами должен быть указан в секундах. С его помощью можно\\, например\\, заставить мигать лампу.\n"..
    "Можно настроить до 8 команд\\, каждая из которых будет содержать номер целевого блока и ожидание следующей команды.\n"..
    "Секвенсор повторяет команды бесконечно\\, если установлен параметр \"Run endless\".\n"..
    "Если ничего не выбрано\\, то будет ожидаться только указанное в секундах время.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Таймер может отправлять команды в разное время. Для каждой командной строки можно указать время\\, номер (номера) цели и саму команду. Это означает\\, что лампы можно включать вечером и выключать утром.\n"..
    "\n"..
    "\n"..
    "\n",
    "Терминал используется в основном для тестирования командного интерфейса других блоков (см. \"Логические/коммутационные блоки\")\\, а также для автоматизации систем с использованием языка программирования BASIC.\n"..
    "Вы также можете назначить команды клавишам и использовать терминал продуктивно.\n"..
    "\n"..
    "    set <button-num> <button-text> <command>\n"..
    "\n"..
    "С помощью команды 'set 1 ON cmd 123 on'\\, например\\, пользовательская клавиша 1 может быть запрограммирована на команду 'cmd 123 on'. При нажатии клавиши команда будет отправлена\\, а ответ выведен на экран.\n"..
    "\n"..
    "Терминал имеет следующие локальные команды:\n"..
    "\n"..
    "  - 'clear' очистить экран\n"..
    "  - 'help' выводит страницу помощи\n"..
    "  - 'pub' переключиться на публичные кнопки\n"..
    "  - 'priv' переключиться на приватные кнопки\n"..
    "\n"..
    "В частном режиме терминал могут использовать только те игроки\\, которые могут строить в этом месте\\, то есть имеют права на защиту.\n"..
    "\n"..
    "В публичном режиме все игроки могут использовать предварительно настроенные ключи.\n"..
    "\n"..
    "Переключиться в режим BASIC можно с помощью открытого гаечного меню. Более подробную информацию о режиме BASIC вы можете найти здесь\n"..
    "\n"..
    "\n"..
    "\n",
    "Цветная лампа может быть включена или выключена с помощью команды 'on' / 'off'. Эта лампа не нуждается в электричестве и может быть окрашена с помощью инструмента аэрографа из мода Unified Dyes и/или с помощью команд Lua/Beduino.\n"..
    "\n"..
    "С помощью команды чата '/ta_color' отображается цветовая палитра со значениями для команд Lua/Beduino\\, а с помощью '/ta_send color <num>' цвет можно изменить.\n"..
    "\n"..
    "\n"..
    "\n",
    "С помощью этих блоков можно реализовать двери и ворота\\, которые можно открывать с помощью команд (блоки исчезают) и снова закрывать. Для каждых ворот или двери требуется один контроллер.\n"..
    "\n"..
    "Внешний вид блоков можно настроить с помощью меню блоков.\n"..
    "Это позволяет реализовать секретные двери\\, которые открываются только для определенных игроков (с помощью детектора игроков).\n"..
    "\n"..
    "\n"..
    "\n",
    "Дверной контроллер используется для управления блоками дверей/ворот TA3. С помощью дверного контроллера необходимо ввести номера блоков дверей/ворот. Если на контроллер двери подается команда 'on' / 'off'\\, это открывает/закрывает дверь или ворота.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Контроллер дверей II (дальше КД2) может снимать и устанавливать все типы блоков. Для настройки КД2 необходимо нажать кнопку \"Запись\". Затем необходимо нажать на все блоки\\, которые должны быть частью двери/ворота. Затем необходимо нажать кнопку \"Готово\". Можно выбрать до 16 блоков. Удаленные блоки сохраняются в инвентаре контроллера. Функционирование контроллера можно проверить вручную с помощью кнопки \"Обмен\". Если на контроллер Door Controller II подается команда 'on' / 'off'\\, он также удаляет или устанавливает блоки.\n"..
    "\n"..
    "С помощью '$send_cmnd(node_number\\, \"exchange\"\\, 2)' отдельные блоки могут быть установлены\\, удалены или заменены другими блоками из инвентаря.\n"..
    "\n"..
    "С помощью '$send_cmnd(node_number\\, \"set\"\\, 2)' блок из инвентаря может быть установлен явно\\, если слот инвентаря не пуст.\n"..
    "\n"..
    "Блок может быть снова удален с помощью '$send_cmnd(node_number\\, \"dig\"\\, 2)'\\, если слот инвентаря пуст.\n"..
    "\n"..
    "Имя блока набора возвращается с помощью '$send_cmnd(node_number\\, \"get\"\\, 2)'.\n"..
    "\n"..
    "Номер слота инвентаря (1 ... 16) должен быть передан в качестве полезной нагрузки во всех трех случаях.\n"..
    "\n"..
    "С помощью '$send_cmnd(node_number\\, \"reset\")' происходит сброс контроллера двери.\n"..
    "\n"..
    "Это также можно использовать для имитации выдвижных лестниц и т.п.\n"..
    "\n"..
    ".\n"..
    "\n",
    "С помощью звукового блока можно воспроизводить различные звуки. Доступны все звуки модов Techage\\, Signs Bot\\, Hyperloop\\, Unified Inventory\\, TA4 Jetpack и Minetest Game.\n"..
    "\n"..
    "Звуки можно выбирать и воспроизводить через меню и с помощью команд.\n"..
    "\n"..
    "  - Команда 'on' для воспроизведения звука\n"..
    "  - Команда 'sound <idx>' для выбора звука по индексу\n"..
    "  - Команда 'gain <volume>' позволяет регулировать громкость с помощью значения '<volume>' (от 1 до 5).\n"..
    "\n"..
    "\n"..
    "\n",
    "Конвертер Mesecons используется для преобразования команд включения/выключения Techage в сигналы Mesecons и наоборот.\n"..
    "Для этого необходимо ввести один или несколько номеров узлов и использовать конвертер с блоками Mesecons.\n"..
    "должны быть подключены через кабели Mesecons. Конвертер Mesecons также может быть сконфигурирован с помощью программатора.\n"..
    "Конвертер Mesecons принимает до 5 команд в секунду\\; при более высокой нагрузке он отключается.\n"..
    "\n"..
    "*Этот узел существует только в том случае\\, если активен мод mesecons!*.\n"..
    "\n"..
    "\n"..
    "\n",
    "Детекторы сканируют окружающее пространство и подают команду 'включить'\\, когда поиск распознан.\n"..
    "\n"..
    "\n"..
    "\n",
    "Детектор - это специальный блок трубок\\, который обнаруживает\\, когда через трубку проходят предметы. Для этого он должен быть подключен к трубкам с обеих сторон. Если предметы проталкиваются в детектор с помощью толкателя\\, они автоматически передаются дальше.\n"..
    "Он посылает сигнал \"включено\"\\, когда предмет распознан\\, и сигнал \"выключено\" секундой позже.\n"..
    "Затем дальнейшие команды блокируются на 8 секунд.\n"..
    "Время ожидания и элементы\\, которые должны вызывать команду\\, можно настроить с помощью открытого гаечного меню.\n"..
    "\n"..
    "\n"..
    "\n",
    "Детектор тележек посылает команду 'on'\\, если он распознал тележку (Minecart) прямо перед собой. Кроме того\\, детектор может перезапустить тележку при получении команды 'on'.\n"..
    "\n"..
    "Детектор также можно запрограммировать на свой собственный номер. В этом случае он толкает все вагоны\\, которые останавливаются рядом с ним (один квартал во всех направлениях).\n"..
    "\n"..
    "\n"..
    "\n",
    "Детектор блоков посылает команду 'on'\\, если обнаруживает\\, что перед ним появляются или исчезают блоки\\, но должен быть настроен соответствующим образом. После возвращения детектора в стандартное состояние (серый блок) посылается команда 'off'. Допустимыми блоками являются все типы блоков и растений\\, но не животные или игроки. Радиус действия датчика составляет 3 блока/метра в направлении стрелки.\n"..
    "\n"..
    "\n"..
    "\n",
    "Детектор игроков посылает команду 'on'\\, если обнаруживает игрока в пределах 4 м от блока. Если игрок снова покидает зону\\, отправляется команда 'off'.\n"..
    "Если поиск должен быть ограничен конкретными игроками\\, можно также ввести имена этих игроков.\n"..
    "\n"..
    "\n"..
    "\n",
    "Детектор света посылает команду 'on'\\, если уровень освещенности блока выше превышает определенный уровень\\, который можно задать через меню правой кнопки мыши.\n"..
    "Если у вас есть TA4 Lua контроллер\\, вы можете получить точное значение уровня освещенности с помощью $get_cmd(num\\, 'light_level').\n"..
    "\n"..
    ".\n"..
    "\n",
    "В TA3 есть те же машины\\, что и в TA2\\, только они мощнее и требуют электричества вместо механического привода.\n"..
    "Поэтому ниже приведены только различные технические характеристики.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Функциональность такая же\\, как TA2.\n"..
    "Производительность составляет 6 элементов каждые 2 с.\n"..
    "\n"..
    "\n"..
    "\n",
    "Функциональность такая же\\, как TA2.\n"..
    "Производительность составляет 12 элементов каждые 4 с.\n"..
    "\n"..
    "\n"..
    "\n",
    "Функциональность такая же\\, как TA2.\n"..
    "Производительность составляет 2 предмета каждые 4 с. Автокрафтер требует 6 ku электроэнергии.\n"..
    "\n"..
    "\n"..
    "\n",
    "Функциональность такая же\\, как TA2\\, только здесь производятся микросхемы TA4 WLAN.\n"..
    "Производительность составляет один чип каждые 6 с. Для этого блоку требуется 12 ku электроэнергии.\n"..
    "\n"..
    "\n"..
    "\n",
    "Функциональность такая же\\, как TA2.\n"..
    "Максимальная глубина - 40 метров. Для работы карьера требуется 12 ku электроэнергии.\n"..
    "\n"..
    "\n"..
    "\n",
    "Функциональность такая же\\, как TA2.\n"..
    "Производительность составляет 2 элемента каждые 4 с. Блок требует 4 ku электроэнергии.\n"..
    "\n"..
    "\n"..
    "\n",
    "Функциональность такая же\\, как TA2.\n"..
    "Вероятность также такая же\\, как и для TA2. Блок также требует 3 ku электроэнергии.\n"..
    "Но в отличие от TA2\\, статус блока TA3 можно считать (контроллер)\n"..
    "\n"..
    "\n"..
    "\n",
    "Функциональность такая же\\, как TA2.\n"..
    "Производительность составляет 2 элемента каждые 4 с. Блок требует 6 ku электроэнергии.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Инжектор представляет собой толкатель TA3 с особыми свойствами. Он имеет меню для настройки. Здесь можно настроить до 8 предметов. Он берет эти предметы только из сундука\\, чтобы передать их машинам с рецептами (автокрафтер\\, промышленная печь и электронная фабрика).\n"..
    "\n"..
    "При передаче в целевой машине используется только одна позиция в инвентаре. Если\\, например\\, в инжекторе настроены только первые три позиции\\, то в инвентаре машины используются только первые три места хранения. Таким образом\\, предотвращается переполнение инвентаря машины.\n"..
    "\n"..
    "Инъектор также можно переключить в \"режим вытягивания\". Тогда он достает предметы из сундука только из тех позиций\\, которые заданы в конфигурации инжектора. При этом тип и позиция предмета должны совпадать. Это позволяет опустошать определенные позиции инвентаря в сундуке.\n"..
    "\n"..
    "Производительность составляет до 8 раз по одному элементу каждые 4 секунды.\n"..
    "\n"..
    ".\n"..
    "\n",
    "",
    "Techage Гаечный ключ имеет несколько функций. Он показывает время\\, положение\\, температуру и биом при нажатии на неизвестный блок.\n"..
    "Если нажать на блок TechAge с командным интерфейсом\\, будут показаны все доступные данные (см. также \"Логические / коммутационные блоки\").\n"..
    "\n"..
    "С помощью Shift + правый клик можно открыть расширенное меню для некоторых блоков. В зависимости от блока здесь можно вызвать дополнительные данные или выполнить специальные настройки. Например\\, в случае генератора можно запрограммировать кривую зарядки/выключения.\n"..
    "\n"..
    "\n"..
    "\n",
    "С помощью программатора номера блоков можно собирать из нескольких блоков правым щелчком мыши и записывать в блок\\, как кнопку/переключатель\\, левым щелчком.\n"..
    "Если нажать в воздухе\\, внутренняя память будет удалена.\n"..
    "\n"..
    ".\n"..
    "\n",
    "Мастерок используется для оштукатуривания силовых кабелей. См. также \"TA Электрический кабель\".\n"..
    "\n"..
    "\n"..
    "\n",
    "Этот инструмент можно использовать для удаления блоков бурильных труб\\, если\\, например\\, в них будет проходить туннель.\n"..
    "\n"..
    "\n"..
    "\n",
    "Отвертка Techage служит заменой обычной отвертке. Она обладает следующими функциями:\n"..
    "\n"..
    "  - Левый клик: повернуть блок влево\n"..
    "  - Щелчок правой кнопкой мыши: повернуть видимую сторону блока вверх\n"..
    "  - Shift + левый клик: сохранить выравнивание щелкнутого блока.\n"..
    "  - Shift + правый клик: применить сохраненное выравнивание к щелкнутому блоку.\n"..
    "\n"..
    ".\n"..
    "\n",
    "TechAge Инструмент для сборки используется для удаления и перестановки блоков Techage без потери номера блока или присвоения ему нового номера при установке. Это полезно\\, например\\, для карьеров\\, так как их часто приходится перемещать.\n"..
    "\n"..
    "  - Левая кнопка: Удалить блок\n"..
    "  - Правая кнопка: Установить блок\n"..
    "\n"..
    "Блок\\, который ранее был удален с помощью инструмента для сборки и должен быть помещен снова\\, должен находиться в крайней левой части инвентаря игрока.\n"..
    "\n"..
    "\n"..
    "\n",
  },
  images = {
    "techage_ta3",
    "",
    "ta3_firebox",
    "ta3_oilbox",
    "ta3_boiler",
    "ta3_turbine",
    "ta3_generator",
    "ta3_cooler",
    "ta3_powerswitch",
    "power_reduction",
    "ta3_powercable",
    "ta3_powerjunction",
    "ta3_powerline",
    "ta3_powerpole",
    "ta3_powerpole4",
    "ta3_powerpole2",
    "ta3_powerswitch",
    "ta3_powerswitchsmall",
    "ta3_powerswitchbox",
    "ta3_tinygenerator",
    "ta3_akkublock",
    "ta3_powerterminal",
    "ta3_motor",
    "",
    "ta3_furnacefirebox",
    "ta3_furnace",
    "ta3_booster",
    "",
    "ta3_tank",
    "ta3_pump",
    "ta3_filler",
    "ta3_pipe",
    "ta3_pipe_wall_entry",
    "ta3_valve",
    "techage_ta3",
    "ta3_oilexplorer",
    "ta3_drillbox",
    "ta3_pumpjack",
    "ta3_drillbit",
    "oiltank",
    "",
    "",
    "",
    "",
    "",
    "techage_ta31",
    "",
    "reboiler",
    "ta3_logic",
    "ta3_button",
    "ta3_command_converter",
    "ta3_flipflop",
    "ta3_logic",
    "ta3_repeater",
    "ta3_sequencer",
    "ta3_timer",
    "ta3_terminal",
    "ta3_colorlamp",
    "ta3_doorblock",
    "ta3_doorcontroller",
    "ta3_doorcontroller",
    "ta3_soundblock",
    "ta3_mesecons_converter",
    "ta3_nodedetector",
    "ta3_detector",
    "ta3_cartdetector",
    "ta3_nodedetector",
    "ta3_playerdetector",
    "ta3_lightdetector",
    "ta3_grinder",
    "ta3_pusher",
    "ta3_distributor",
    "ta3_autocrafter",
    "ta3_electronicfab",
    "ta3_quarry",
    "ta3_gravelsieve",
    "ta3_gravelrinser",
    "ta3_grinder",
    "ta3_injector",
    "",
    "ta3_end_wrench",
    "ta3_programmer",
    "ta3_trowel",
    "ta3_drill_pipe_wrench",
    "ta3_screwdriver",
    "techage:assembly_tool",
  },
  plans = {
    "",
    "coalpowerstation",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "ta3_furnace",
    "",
    "",
    "",
    "ta3_tank",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "ta3_loading",
    "",
    "",
    "",
    "ta3_distiller",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
  }
}